---
kind: type
id: T:Autodesk.Revit.DB.STLExportOptions
source: html/c8870dfe-9259-4981-4545-a6c0d0440552.htm
---
# Autodesk.Revit.DB.STLExportOptions

The export options used by exporting STL format file.

## Syntax (C#)
```csharp
public class STLExportOptions : BIMExportOptions
```